app/controllers/restaurants_controller.rb

  def search
    @restaurants = Restaurant.search(
      name_or_description_cont: params[:q]
    ).result
---
SELECT "restaurants".* FROM "restaurants"

  def set_restaurant
    @restaurant = Restaurant.find_by(id: params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]